03_Programming_in_Lean.org
#+Title: An Introduction to Lean
#+Author: [[http://www.andrew.cmu.edu/user/avigad][Jeremy Avigad]], [[http://leodemoura.github.io][Leonardo de Moura]], [[https://gebner.org/][Gabriel Ebner]], and Sebastian Ullrich

* Programming in Lean
:PROPERTIES:
  :CUSTOM_ID: Programming_in_Lean
:END:

Lean aims to support both mathematical abstraction alongside pragmatic
computation, allowing both to interact in a common foundational
framework. Some users will be interested in viewing Lean as a
programming language, and making sure that every assertion has direct
computational meaning. Others will be interested in treating Lean as a
system for reasoning about abstract mathematical objects and
assertions, which may not have straightforward computational
interpretations.  Lean is designed to be a comfortable environment for
both kinds of users.

But Lean is also designed to support users who want to maintain both
world views at once. This includes mathematical users who, having
developed an abstract mathematical theory, would then like to start
computing with the mathematical objects in a verified way. It also
includes computer scientists and engineers who, having written a
program or modeled a piece of hardware or software in Lean, would like
to verify claims about it against a background mathematical theory of
arithmetic, analysis, dynamical systems, or stochastic processes.

Lean employs a number of carefully chosen devices to support a clean
and principled unification of the two worlds. Chief among these is the
inclusion of a type =Prop= of propositions, or assertions. If =p= is
an element of type =Prop=, you can think of an element =t : p= as
representing evidence that =p= is true, or a proof of =p=, or simply
the fact that =p= holds. The element =t=, however, does not bear any
computational information. In contrast, if =α= is an element of =Type
u= for any =u= greater than 0 and =t : α=, then =t= contains data, and
can be evaluated.

We saw in [[file:02_Defining_Objects_in_Lean.org::#Nonconstructive_Definitions][Section 2.5]] that Lean allows us to define functions that
produce data from a proposition =∃ x, p x=, but that such functions
are marked as =noncomputable=, and do not generate
bytecode. Expressions =t : α=, where =α= is a type of data, can
contain subexpressions that are elements of =Prop=, and these can even
refer to nonconstructive objects. During the extraction of bytecode,
these elements are simply ignored, and do not contribute to the
computational content of =t=.

For that reason, abstract elements in Lean's library can have
/computational refinements/. For example, for every type, =α=, there
is another type, =set α=, of sets of elements of =α= and some sets
satisfy the property of being =finite=. Saying that a set is finite is
equivalent to saying that there exists a list that contains exactly
the same elements. But this statement is a proposition, which means
that it is impossible to extract such a list from the mere assertion
that it exists. For that reason, the standard library also defines a
type =finset α=, which is better suited to computation. An element
=s : finset α= is represented by a list of elements of =α= without
duplicates. Using quotient types, we can arrange that lists that
differ up to permutation are considered equal, and a defining
principle of quotient types allows us to define a function on =finset
α= in terms of any list that represents it, provided that we show that
our definition is invariant under permutations of the
list. Computationally, an element of =finset α= /is/ just a
list. Everything else is essentially a contract that we commit
ourselves to obeying when working with elements of =finset α=. The
contract is important to reasoning about the results of our
computations and their properties, but it plays no role in the
computation itself.

# TODO(Jeremy): this is not entirely true: we have not yet ported
# sets, finite, etc.

As another example of the interaction between propositions and data,
consider the fact that we do not always have algorithms that determine
whether a proposition is true (consider, for example, the proposition
that a Turing machine halts). In many cases, however, we do. For
example, assertions =m = n= and =m < n= about natural numbers, and
Boolean combinations of these, can be evaluated. Propositions like
this are said to be /decidable/. Lean's library uses class inference
to infer the decidability, and when it succeeds, you can use a
decidable property in an =if= ... =then= ... =else= conditional
statement. Computationally, what is going on is that class inference
finds the relevant procedure, and the bytecode evaluator uses it.

One side effect of the choice of CIC as a foundation is that all
functions we define, computational or not, are total. Once again,
dependent type theory offers various mechanisms that we can use to
restrict the range of applicability of a function, and some will be
described below.

