03_Programming_in_Lean.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-07-24 Mon 23:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>An Introduction to Lean</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="[[http://www.andrew.cmu.edu/user/avigad][Jeremy Avigad]]Jeremy Avigad, [[http://leodemoura.github.io][Leonardo de Moura]]Leonardo de Moura, [[https://gebner.org/][Gabriel Ebner]]Gabriel Ebner, and Sebastian Ullrich" />
<link rel="stylesheet" href="css/tutorial.css"/>
<link rel="stylesheet" href="css/code.css"/>
<link rel='import' href='juicy-ace-editor.html'/>
</head>
<body>
<div id="content">
<h1 class="title">An Introduction to Lean</h1>

<div id="outline-container-orgbdd2724" class="outline-2">
<h2 id="Programming_in_Lean"><a id="orgbdd2724"></a><span class="section-number-2"> 3</span> Programming in Lean</h2>
<div class="outline-text-2" id="text-Programming_in_Lean">
<p>
Lean aims to support both mathematical abstraction alongside pragmatic
computation, allowing both to interact in a common foundational
framework. Some users will be interested in viewing Lean as a
programming language, and making sure that every assertion has direct
computational meaning. Others will be interested in treating Lean as a
system for reasoning about abstract mathematical objects and
assertions, which may not have straightforward computational
interpretations.  Lean is designed to be a comfortable environment for
both kinds of users.
</p>

<p>
But Lean is also designed to support users who want to maintain both
world views at once. This includes mathematical users who, having
developed an abstract mathematical theory, would then like to start
computing with the mathematical objects in a verified way. It also
includes computer scientists and engineers who, having written a
program or modeled a piece of hardware or software in Lean, would like
to verify claims about it against a background mathematical theory of
arithmetic, analysis, dynamical systems, or stochastic processes.
</p>

<p>
Lean employs a number of carefully chosen devices to support a clean
and principled unification of the two worlds. Chief among these is the
inclusion of a type <code>Prop</code> of propositions, or assertions. If <code>p</code> is
an element of type <code>Prop</code>, you can think of an element <code>t : p</code> as
representing evidence that <code>p</code> is true, or a proof of <code>p</code>, or simply
the fact that <code>p</code> holds. The element <code>t</code>, however, does not bear any
computational information. In contrast, if <code>α</code> is an element of <code>Type
u</code> for any <code>u</code> greater than 0 and <code>t : α</code>, then <code>t</code> contains data, and
can be evaluated.
</p>

<p>
We saw in <a href="#" onclick="myModule.loadTutorial('02_Defining_Objects_in_Lean.html', 'Nonconstructive_Definitions')">Section 2.5</a> that Lean allows us to define functions that
produce data from a proposition <code>∃ x, p x</code>, but that such functions
are marked as <code>noncomputable</code>, and do not generate
bytecode. Expressions <code>t : α</code>, where <code>α</code> is a type of data, can
contain subexpressions that are elements of <code>Prop</code>, and these can even
refer to nonconstructive objects. During the extraction of bytecode,
these elements are simply ignored, and do not contribute to the
computational content of <code>t</code>.
</p>

<p>
For that reason, abstract elements in Lean's library can have
<i>computational refinements</i>. For example, for every type, <code>α</code>, there
is another type, <code>set α</code>, of sets of elements of <code>α</code> and some sets
satisfy the property of being <code>finite</code>. Saying that a set is finite is
equivalent to saying that there exists a list that contains exactly
the same elements. But this statement is a proposition, which means
that it is impossible to extract such a list from the mere assertion
that it exists. For that reason, the standard library also defines a
type <code>finset α</code>, which is better suited to computation. An element
<code>s : finset α</code> is represented by a list of elements of <code>α</code> without
duplicates. Using quotient types, we can arrange that lists that
differ up to permutation are considered equal, and a defining
principle of quotient types allows us to define a function on <code>finset
α</code> in terms of any list that represents it, provided that we show that
our definition is invariant under permutations of the
list. Computationally, an element of <code>finset α</code> <i>is</i> just a
list. Everything else is essentially a contract that we commit
ourselves to obeying when working with elements of <code>finset α</code>. The
contract is important to reasoning about the results of our
computations and their properties, but it plays no role in the
computation itself.
</p>

<p>
As another example of the interaction between propositions and data,
consider the fact that we do not always have algorithms that determine
whether a proposition is true (consider, for example, the proposition
that a Turing machine halts). In many cases, however, we do. For
example, assertions <code>m = n</code> and <code>m &lt; n</code> about natural numbers, and
Boolean combinations of these, can be evaluated. Propositions like
this are said to be <i>decidable</i>. Lean's library uses class inference
to infer the decidability, and when it succeeds, you can use a
decidable property in an <code>if</code> &#x2026; <code>then</code> &#x2026; <code>else</code> conditional
statement. Computationally, what is going on is that class inference
finds the relevant procedure, and the bytecode evaluator uses it.
</p>

<p>
One side effect of the choice of CIC as a foundation is that all
functions we define, computational or not, are total. Once again,
dependent type theory offers various mechanisms that we can use to
restrict the range of applicability of a function, and some will be
described below.
</p>
</div>
