03_Programming_in_Lean.org
** Evaluating Expressions

When translating expressions to byte code, Lean's virtual machine
evaluator ignores type information entirely. The whole elaborate
typing schema of the CIC serves to ensure that terms make sense, and
mean what we think they mean. Type checking is entirely static: when
evaluating a term =t= of type =α=, the bytecode evaluator ignores =α=,
and simply computes the value of =t=, as described below. As noted
above, any subexpressions of =t= whose type is an element of =Prop=
are computationally irrelevant, and they are ignored too.

The evaluation of expressions follows the computational rules of the
CIC. In particular:
- To evaluate a function application =(λ x, s) t=, the bytecode
  evaluator evaluates =t=, and then evaluates =s= with =x=
  instantiated to =t=.
- To evaluate an eliminator for an inductively defined type --- in
  other words, a function defined by pattern matching or recursion ---
  the bytecode evaluator waits until all the arguments are given,
  evaluates the first one, and, on the basis of the result, applies
  the relevant case or recursive call.

We have already seen that Lean can evaluate expressions involving
natural numbers, integers, lists, and booleans.
#+BEGIN_SRC lean
#eval 22 + 77 * 11
#eval tt && (ff || tt)
#eval [1, 2, 3] ++ 4 :: [5, 6, 7]
#+END_SRC

Lean can evaluate conditional expressions:
#+BEGIN_SRC lean
#eval if 11 > 5 ∧ ff then 27 else 33 + 12

#eval if 7 ∈ [1, 3, 5] then "hooray!" else "awww..."
#+END_SRC
Here is a more interesting example:
#+BEGIN_SRC lean
def craps (roll : ℕ) (come_out : bool) (point : ℕ) : string :=
if (come_out ∧ (roll = 7 ∨ roll = 11)) ∨ (¬ come_out ∧ roll = point) then
  "You win!"
else if (come_out ∧ roll ∈ [2, 3, 12]) ∨ (¬ come_out ∧ roll = 7) then
  "You lose!"
else 
  "Roll again."

#eval craps 7 tt 4
#eval craps 11 ff 2
#+END_SRC

The standard library defines a number of common operations on lists:
#+BEGIN_SRC lean
#eval list.range 100

#eval list.map (λ x, x * x) (list.range 100)

#eval list.filter (λ x, x > 50) (list.range 100)

#eval list.foldl (+) 0 (list.range 100) 
#+END_SRC

A =char= is a natural number that is less than 255. You can enter the
character "A," for example, by typing ='A'=. Lean defines some basic
operations on characters:
#+BEGIN_SRC lean
open char

#eval to_lower 'X'
#eval to_lower 'x'
#eval to_lower '!'

#eval to_lower '!'

#eval if is_punctuation '?' then tt else ff
#+END_SRC
In the example above, we have to tell Lean how to define a decision
procedure for the predicate =is_punctuation=. We do this simply by
unfolding the definition and asking Lean to use the inferred decision
procedure for list membership.

Strings can be mapped to lists of characters and back, so operations
on lists and be used with strings.
#+BEGIN_SRC lean
namespace string

def filter (p : char → Prop) [decidable_pred p] (s : string) : string :=
((s.to_list).filter p).to_string

def map (f : char → char) (l : string) : string :=
(l.to_list.map f).to_string

def to_lower (s : string) : string := s.map char.to_lower

def reverse (s : string) : string := s.to_list.reverse.to_string

def remove_punctuation (s : string) : string :=
s.filter (λ c, ¬ char.is_punctuation c)

end string
#+END_SRC
We can use these to write a procedure that tests to see whether a
given sentence is a palindrome.
#+BEGIN_SRC lean
namespace string

def filter (p : char → Prop) [decidable_pred p] (s : string) : string :=
((s.to_list).filter p).to_string

def map (f : char → char) (l : string) : string :=
(l.to_list.map f).to_string

def to_lower (s : string) : string := s.map char.to_lower

def reverse (s : string) : string := s.to_list.reverse.to_string

def remove_punctuation (s : string) : string :=
s.filter (λ c, ¬ char.is_punctuation c)

-- BEGIN
def test_palindrome (s : string) : bool :=
let s' := to_lower (remove_punctuation s) in
if s' = reverse s' then tt else ff

#eval test_palindrome "A man, a plan, a canal -- Panama!"
#eval test_palindrome "Madam, I'm Adam!"
#eval test_palindrome "This one is not even close."
-- END

end string
#+END_SRC

