03_Programming_in_Lean.html

<div id="outline-container-orgac51330" class="outline-3">
<h3 id="orgac51330"><span class="section-number-3"> 3.1</span> Evaluating Expressions</h3>
<div class="outline-text-3" id="text-1-1">
<p>
When translating expressions to byte code, Lean's virtual machine
evaluator ignores type information entirely. The whole elaborate
typing schema of the CIC serves to ensure that terms make sense, and
mean what we think they mean. Type checking is entirely static: when
evaluating a term <code>t</code> of type <code>α</code>, the bytecode evaluator ignores <code>α</code>,
and simply computes the value of <code>t</code>, as described below. As noted
above, any subexpressions of <code>t</code> whose type is an element of <code>Prop</code>
are computationally irrelevant, and they are ignored too.
</p>

<p>
The evaluation of expressions follows the computational rules of the
CIC. In particular:
</p>
<ul class="org-ul">
<li>To evaluate a function application <code>(λ x, s) t</code>, the bytecode
evaluator evaluates <code>t</code>, and then evaluates <code>s</code> with <code>x</code>
instantiated to <code>t</code>.</li>
<li>To evaluate an eliminator for an inductively defined type &#x2014; in
other words, a function defined by pattern matching or recursion &#x2014;
the bytecode evaluator waits until all the arguments are given,
evaluates the first one, and, on the basis of the result, applies
the relevant case or recursive call.</li>
</ul>

<p>
We have already seen that Lean can evaluate expressions involving
natural numbers, integers, lists, and booleans.
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-1' mode="ace/mode/lean" readonly="true">#eval 22 + 77 * 11
#eval tt &amp;&amp; (ff || tt)
#eval [1, 2, 3] ++ 4 :: [5, 6, 7]
</juicy-ace-editor><div id='lean-full-code-1' style='display:none'>#eval 22 + 77 * 11
#eval tt &amp;&amp; (ff || tt)
#eval [1, 2, 3] ++ 4 :: [5, 6, 7]
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-1').text());">Try it yourself &raquo;</button></div>
</div>

<p>
Lean can evaluate conditional expressions:
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-2' mode="ace/mode/lean" readonly="true">#eval if 11 &gt; 5 ∧ ff then 27 else 33 + 12

#eval if 7 ∈ [1, 3, 5] then "hooray!" else "awww..."
</juicy-ace-editor><div id='lean-full-code-2' style='display:none'>#eval if 11 &gt; 5 ∧ ff then 27 else 33 + 12

#eval if 7 ∈ [1, 3, 5] then "hooray!" else "awww..."
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-2').text());">Try it yourself &raquo;</button></div>
</div>
<p>
Here is a more interesting example:
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-3' mode="ace/mode/lean" readonly="true">def craps (roll : ℕ) (come_out : bool) (point : ℕ) : string :=
if (come_out ∧ (roll = 7 ∨ roll = 11)) ∨ (¬ come_out ∧ roll = point) then
  "You win!"
else if (come_out ∧ roll ∈ [2, 3, 12]) ∨ (¬ come_out ∧ roll = 7) then
  "You lose!"
else 
  "Roll again."

#eval craps 7 tt 4
#eval craps 11 ff 2
</juicy-ace-editor><div id='lean-full-code-3' style='display:none'>def craps (roll : ℕ) (come_out : bool) (point : ℕ) : string :=
if (come_out ∧ (roll = 7 ∨ roll = 11)) ∨ (¬ come_out ∧ roll = point) then
  "You win!"
else if (come_out ∧ roll ∈ [2, 3, 12]) ∨ (¬ come_out ∧ roll = 7) then
  "You lose!"
else 
  "Roll again."

#eval craps 7 tt 4
#eval craps 11 ff 2
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-3').text());">Try it yourself &raquo;</button></div>
</div>

<p>
The standard library defines a number of common operations on lists:
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-4' mode="ace/mode/lean" readonly="true">#eval list.range 100

#eval list.map (λ x, x * x) (list.range 100)

#eval list.filter (λ x, x &gt; 50) (list.range 100)

#eval list.foldl (+) 0 (list.range 100)
</juicy-ace-editor><div id='lean-full-code-4' style='display:none'>#eval list.range 100

#eval list.map (λ x, x * x) (list.range 100)

#eval list.filter (λ x, x &gt; 50) (list.range 100)

#eval list.foldl (+) 0 (list.range 100)
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-4').text());">Try it yourself &raquo;</button></div>
</div>

<p>
A <code>char</code> is a natural number that is less than 255. You can enter the
character "A," for example, by typing <code>'A'</code>. Lean defines some basic
operations on characters:
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-5' mode="ace/mode/lean" readonly="true">open char

#eval to_lower 'X'
#eval to_lower 'x'
#eval to_lower '!'

#eval to_lower '!'

#eval if is_punctuation '?' then tt else ff
</juicy-ace-editor><div id='lean-full-code-5' style='display:none'>open char

#eval to_lower 'X'
#eval to_lower 'x'
#eval to_lower '!'

#eval to_lower '!'

#eval if is_punctuation '?' then tt else ff
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-5').text());">Try it yourself &raquo;</button></div>
</div>
<p>
In the example above, we have to tell Lean how to define a decision
procedure for the predicate <code>is_punctuation</code>. We do this simply by
unfolding the definition and asking Lean to use the inferred decision
procedure for list membership.
</p>

<p>
Strings can be mapped to lists of characters and back, so operations
on lists and be used with strings.
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-6' mode="ace/mode/lean" readonly="true">namespace string

def filter (p : char → Prop) [decidable_pred p] (s : string) : string :=
((s.to_list).filter p).to_string

def map (f : char → char) (l : string) : string :=
(l.to_list.map f).to_string

def to_lower (s : string) : string := s.map char.to_lower

def reverse (s : string) : string := s.to_list.reverse.to_string

def remove_punctuation (s : string) : string :=
s.filter (λ c, ¬ char.is_punctuation c)

end string
</juicy-ace-editor><div id='lean-full-code-6' style='display:none'>namespace string

def filter (p : char → Prop) [decidable_pred p] (s : string) : string :=
((s.to_list).filter p).to_string

def map (f : char → char) (l : string) : string :=
(l.to_list.map f).to_string

def to_lower (s : string) : string := s.map char.to_lower

def reverse (s : string) : string := s.to_list.reverse.to_string

def remove_punctuation (s : string) : string :=
s.filter (λ c, ¬ char.is_punctuation c)

end string
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-6').text());">Try it yourself &raquo;</button></div>
</div>
<p>
We can use these to write a procedure that tests to see whether a
given sentence is a palindrome.
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-7' mode="ace/mode/lean" readonly="true">def test_palindrome (s : string) : bool :=
let s' := to_lower (remove_punctuation s) in
if s' = reverse s' then tt else ff

#eval test_palindrome "A man, a plan, a canal -- Panama!"
#eval test_palindrome "Madam, I'm Adam!"
#eval test_palindrome "This one is not even close."</juicy-ace-editor><div id='lean-full-code-7' style='display:none'>namespace string

def filter (p : char → Prop) [decidable_pred p] (s : string) : string :=
((s.to_list).filter p).to_string

def map (f : char → char) (l : string) : string :=
(l.to_list.map f).to_string

def to_lower (s : string) : string := s.map char.to_lower

def reverse (s : string) : string := s.to_list.reverse.to_string

def remove_punctuation (s : string) : string :=
s.filter (λ c, ¬ char.is_punctuation c)

def test_palindrome (s : string) : bool :=
let s' := to_lower (remove_punctuation s) in
if s' = reverse s' then tt else ff

#eval test_palindrome "A man, a plan, a canal -- Panama!"
#eval test_palindrome "Madam, I'm Adam!"
#eval test_palindrome "This one is not even close."

end string
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-7').text());">Try it yourself &raquo;</button></div>
</div>
</div>
</div>
