03_Programming_in_Lean.org
** Recursive Definitions
:PROPERTIES:
  :CUSTOM_ID: Recursive_Definitions
:END:

Lean supports definition of functions by structural recursion on its
arguments. 
#+BEGIN_SRC lean
open nat

def fact : ℕ → ℕ
| 0        := 1
| (succ n) := (succ n) * fact n

#eval fact 100
#+END_SRC
Lean recognizes that addition on the natural numbers is defined in
terms of the =succ= constructor, so you can also use more conventional
mathematical notation.
#+BEGIN_SRC lean
def fact : ℕ → ℕ
| 0     := 1
| (n+1) := (n+1) * fact n
#+END_SRC
Lean will compile definitions like these down to the primitives of the
Calculus of Inductive Constructions, though in the case of =fact= it
is straightforward to define it from the primitive recursion principle
directly.

Lean's function definition system can handle more elaborate forms of
pattern matching with defaults. For example, the following function
returns true if and only if one of its arguments is positive.
#+BEGIN_SRC lean
def foo : ℕ → ℕ → ℕ → bool
| (n+1) _      _     := tt
| _     (m+1)  _     := tt
| _      _     (k+1) := tt
| _      _        _  := ff
#+END_SRC

We can define the sequence of Fibonacci numbers in a natural way:
#+BEGIN_SRC lean
def fib : ℕ → ℕ
| 0     := 1
| 1     := 1
| (n+2) := fib (n+1) + fib n

#eval fib 100
#+END_SRC
The naive implementation runs the risk of an exponential run time,
since the computation of =fib (n+2)= calls for two independent
computations of =fib n=, one hidden in the computation of =fib
(n+1)=. In fact, the current Lean compilation scheme avoids this,
because it joins the recursive falls in a single tuple and evaluates
them both at once. We can do this explictly, thereby avoiding reliance
on the inner workings of Lean's function definition system, by
defining an auxiliary function that computes the values in pairs:
#+BEGIN_SRC lean
def fib_aux : ℕ → ℕ × ℕ
| 0     := (0, 1)
| (n+1) := let p := fib_aux n in (p.2, p.1 + p.2)

def fib n := (fib_aux n).2

#eval fib 100
#+END_SRC
A similar solution is to use additional arguments to accumulate
partial results:
#+BEGIN_SRC lean
def fib_aux : ℕ → ℕ → ℕ → ℕ
| 0     a b := b
| (n+1) a b := fib_aux n b (a+b)

def fib n := fib_aux n 0 1

#eval fib 100
#+END_SRC
 
Functions on lists are naturally defined by structural
recursion. These definitions are taken from the standard library:
#+BEGIN_SRC lean
namespace hide
open list

-- BEGIN
universe u
variable {α : Type u}

def append : list α → list α → list α
| []       l := l
| (h :: s) t := h :: (append s t)

def mem : α → list α → Prop
| a []       := false
| a (b :: l) := a = b ∨ mem a l

def concat : list α → α → list α
| []     a := [a]
| (b::l) a := b :: concat l a

def length : list α → nat
| []       := 0
| (a :: l) := length l + 1

def empty : list α → bool
| []       := tt
| (_ :: _) := ff

-- END
end hide
#+END_SRC

# TODO(Jeremy): discuss dependent recursion

# TODO(Jeremy): discuss well-founded recursion when the compiler can
# handle it. 

