03_Programming_in_Lean.html

<div id="outline-container-org4d27adf" class="outline-3">
<h3 id="Recursive_Definitions"><a id="org4d27adf"></a><span class="section-number-3"> 3.2</span> Recursive Definitions</h3>
<div class="outline-text-3" id="text-Recursive_Definitions">
<p>
Lean supports definition of functions by structural recursion on its
arguments. 
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-8' mode="ace/mode/lean" readonly="true">open nat

def fact : ℕ → ℕ
| 0        := 1
| (succ n) := (succ n) * fact n

#eval fact 100
</juicy-ace-editor><div id='lean-full-code-8' style='display:none'>open nat

def fact : ℕ → ℕ
| 0        := 1
| (succ n) := (succ n) * fact n

#eval fact 100
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-8').text());">Try it yourself &raquo;</button></div>
</div>
<p>
Lean recognizes that addition on the natural numbers is defined in
terms of the <code>succ</code> constructor, so you can also use more conventional
mathematical notation.
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-9' mode="ace/mode/lean" readonly="true">def fact : ℕ → ℕ
| 0     := 1
| (n+1) := (n+1) * fact n
</juicy-ace-editor><div id='lean-full-code-9' style='display:none'>def fact : ℕ → ℕ
| 0     := 1
| (n+1) := (n+1) * fact n
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-9').text());">Try it yourself &raquo;</button></div>
</div>
<p>
Lean will compile definitions like these down to the primitives of the
Calculus of Inductive Constructions, though in the case of <code>fact</code> it
is straightforward to define it from the primitive recursion principle
directly.
</p>

<p>
Lean's function definition system can handle more elaborate forms of
pattern matching with defaults. For example, the following function
returns true if and only if one of its arguments is positive.
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-10' mode="ace/mode/lean" readonly="true">def foo : ℕ → ℕ → ℕ → bool
| (n+1) _      _     := tt
| _     (m+1)  _     := tt
| _      _     (k+1) := tt
| _      _        _  := ff
</juicy-ace-editor><div id='lean-full-code-10' style='display:none'>def foo : ℕ → ℕ → ℕ → bool
| (n+1) _      _     := tt
| _     (m+1)  _     := tt
| _      _     (k+1) := tt
| _      _        _  := ff
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-10').text());">Try it yourself &raquo;</button></div>
</div>

<p>
We can define the sequence of Fibonacci numbers in a natural way:
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-11' mode="ace/mode/lean" readonly="true">def fib : ℕ → ℕ
| 0     := 1
| 1     := 1
| (n+2) := fib (n+1) + fib n

#eval fib 100
</juicy-ace-editor><div id='lean-full-code-11' style='display:none'>def fib : ℕ → ℕ
| 0     := 1
| 1     := 1
| (n+2) := fib (n+1) + fib n

#eval fib 100
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-11').text());">Try it yourself &raquo;</button></div>
</div>
<p>
The naive implementation runs the risk of an exponential run time,
since the computation of <code>fib (n+2)</code> calls for two independent
computations of <code>fib n</code>, one hidden in the computation of <code>fib
(n+1)</code>. In fact, the current Lean compilation scheme avoids this,
because it joins the recursive falls in a single tuple and evaluates
them both at once. We can do this explictly, thereby avoiding reliance
on the inner workings of Lean's function definition system, by
defining an auxiliary function that computes the values in pairs:
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-12' mode="ace/mode/lean" readonly="true">def fib_aux : ℕ → ℕ × ℕ
| 0     := (0, 1)
| (n+1) := let p := fib_aux n in (p.2, p.1 + p.2)

def fib n := (fib_aux n).2

#eval fib 100
</juicy-ace-editor><div id='lean-full-code-12' style='display:none'>def fib_aux : ℕ → ℕ × ℕ
| 0     := (0, 1)
| (n+1) := let p := fib_aux n in (p.2, p.1 + p.2)

def fib n := (fib_aux n).2

#eval fib 100
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-12').text());">Try it yourself &raquo;</button></div>
</div>
<p>
A similar solution is to use additional arguments to accumulate
partial results:
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-13' mode="ace/mode/lean" readonly="true">def fib_aux : ℕ → ℕ → ℕ → ℕ
| 0     a b := b
| (n+1) a b := fib_aux n b (a+b)

def fib n := fib_aux n 0 1

#eval fib 100
</juicy-ace-editor><div id='lean-full-code-13' style='display:none'>def fib_aux : ℕ → ℕ → ℕ → ℕ
| 0     a b := b
| (n+1) a b := fib_aux n b (a+b)

def fib n := fib_aux n 0 1

#eval fib 100
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-13').text());">Try it yourself &raquo;</button></div>
</div>

<p>
Functions on lists are naturally defined by structural
recursion. These definitions are taken from the standard library:
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-14' mode="ace/mode/lean" readonly="true">universe u
variable {α : Type u}

def append : list α → list α → list α
| []       l := l
| (h :: s) t := h :: (append s t)

def mem : α → list α → Prop
| a []       := false
| a (b :: l) := a = b ∨ mem a l

def concat : list α → α → list α
| []     a := [a]
| (b::l) a := b :: concat l a

def length : list α → nat
| []       := 0
| (a :: l) := length l + 1

def empty : list α → bool
| []       := tt
| (_ :: _) := ff
</juicy-ace-editor><div id='lean-full-code-14' style='display:none'>namespace hide
open list

universe u
variable {α : Type u}

def append : list α → list α → list α
| []       l := l
| (h :: s) t := h :: (append s t)

def mem : α → list α → Prop
| a []       := false
| a (b :: l) := a = b ∨ mem a l

def concat : list α → α → list α
| []     a := [a]
| (b::l) a := b :: concat l a

def length : list α → nat
| []       := 0
| (a :: l) := length l + 1

def empty : list α → bool
| []       := tt
| (_ :: _) := ff

end hide
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-14').text());">Try it yourself &raquo;</button></div>
</div>
</div>
</div>
