03_Programming_in_Lean.org
** Inhabited Types, Subtypes, and Option Types

In the Calculus of Inductive Constructions, every term denotes
something. In particular, if =f= has a function type and =t= has the
corresponding argument type, the =f t= denotes some object. In other
words, a function defined on a type has to be define on /every/
element of that type, so that every function is total on its domain.

It often happens that a function is naturally defined only on some
elements of a type. For example, one can take the head of a list only
if it is nonempty, and one can divide one rational number or real
number by another as long as the second is nonzero. There are a number
of ways of handling that in dependent type theory.

The first, and simplest, is to totalize the function, by assigning an
arbitrary or conveniently chosen value where the function would
otherwise be undefined. For example, it is convenient to take =x / 0=
to be equal to =0=. A downside is that this can run counter to
mathematical intuitions. But it does give a precise meaning to the
division symbol, even if it is a nonconventional one. (The treatment
of undefined values in ordinary mathematics is often ambiguous and
sloppy anyhow.)

It helps that the Lean standard library defines a type class,
=inhabited α=, that can be used to keep track of types that are known
to have at least one element, and to infer such an element. The
expressions =default α= and =arbitrary α= both denote the element that
is inferred. The second is unfolded less eagerly by Lean's elaborator,
and should be used to indicate that you do not want to make any
assumptions about the value returned (though ultimately nothing can
stop a theory making use of the fact that the arbitrary element of
nat, say, is chosen to be zero). The list library defines the =head=
function as follows:
#+BEGIN_SRC lean
universe u
variable {α : Type u}

def head [inhabited α] : list α → α
| []       := default α
| (a :: l) := a
#+END_SRC

Another possibility is to add a precondition to the function. We can
do this because in the CIC, an assertion can be treated as an argument
to a function. The following function explicitly requires evidence
that the argument =l= is not the empty list.
#+BEGIN_SRC lean
universe u
variable {α : Type u}

-- BEGIN
def first : Π (l : list α), l ≠ [] → α
| []        h := absurd rfl h
| (a :: l₀) h := a
-- END
#+END_SRC
This contract ensures that =first= will never be called to evaluate
the first element of an empty list. The check is entirely static; the
evidence is ignored by the bytecode evaluator.

A closely related solution is to use a =subtype=. This simply bundles
together the data and the precondition. 
#+BEGIN_SRC lean
universe u
variable {α : Type u}

def first : Π (l : list α), l ≠ [] → α
| []        h := absurd rfl h
| (a :: l₀) h := a

-- BEGIN
def first' : {l₀ // l₀ ≠ []} → α :=
λ l, first l.1 l.2
-- END
#+END_SRC
Here, the type ={l₀ // l₀ ≠ []}= consists of (dependent) pairs, where the first
element is a list and the second is evidence that the list is
nonempty. In a similar way, ={n // (n : ℤ) > 0}= denotes the type of
positive integers. Using subtypes and preconditions can be inconvenient at
times, because using them requires a mixture of proof and
calculation. But subtypes are especially useful when the constraints
are common enough that is pays to develop a library of functions that
take and return elements satisfying them --- in other words, when the
subtype is really worthy of being considered a type in its own right.

Yet another solution is to signal the success or failure of the function
on the output, using an =option= type. This is defined in the standard
library as follows:
#+BEGIN_SRC lean
namespace hide

universe u

-- BEGIN
inductive option (α : Type u)
| none {} : option
| some    : α → option
-- END

end hide
#+END_SRC
You can think of the return value =none= as signifying that the
function is undefined at that point, whereas =some a= denotes a return
value of =a=. (The inscription ={}= after the none constructor
indicates that the argument =α= should be marked implicit, even though
it cannot be inferred from other arguments.) For example, then =nth=
element function is defined in the list library as follows:
#+BEGIN_SRC lean
universe u
variables {α : Type u} [inhabited α]

open option nat

-- BEGIN
def nth : list α → nat → option α
| []       n     := none
| (a :: l) 0     := some a
| (a :: l) (n+1) := nth l n
-- END
#+END_SRC
To use an element =oa= of type =option α=, one typically has to
pattern match on the cases =none= and =some α=. Doing this manually in the
course of a computation can be tedious, but it is much more pleasant
and natural using /monads/, which we turn to next.

