03_Programming_in_Lean.html

<div id="outline-container-orgce8ddc4" class="outline-3">
<h3 id="orgce8ddc4"><span class="section-number-3"> 3.3</span> Inhabited Types, Subtypes, and Option Types</h3>
<div class="outline-text-3" id="text-1-3">
<p>
In the Calculus of Inductive Constructions, every term denotes
something. In particular, if <code>f</code> has a function type and <code>t</code> has the
corresponding argument type, the <code>f t</code> denotes some object. In other
words, a function defined on a type has to be define on <i>every</i>
element of that type, so that every function is total on its domain.
</p>

<p>
It often happens that a function is naturally defined only on some
elements of a type. For example, one can take the head of a list only
if it is nonempty, and one can divide one rational number or real
number by another as long as the second is nonzero. There are a number
of ways of handling that in dependent type theory.
</p>

<p>
The first, and simplest, is to totalize the function, by assigning an
arbitrary or conveniently chosen value where the function would
otherwise be undefined. For example, it is convenient to take <code>x / 0</code>
to be equal to <code>0</code>. A downside is that this can run counter to
mathematical intuitions. But it does give a precise meaning to the
division symbol, even if it is a nonconventional one. (The treatment
of undefined values in ordinary mathematics is often ambiguous and
sloppy anyhow.)
</p>

<p>
It helps that the Lean standard library defines a type class,
<code>inhabited α</code>, that can be used to keep track of types that are known
to have at least one element, and to infer such an element. The
expressions <code>default α</code> and <code>arbitrary α</code> both denote the element that
is inferred. The second is unfolded less eagerly by Lean's elaborator,
and should be used to indicate that you do not want to make any
assumptions about the value returned (though ultimately nothing can
stop a theory making use of the fact that the arbitrary element of
nat, say, is chosen to be zero). The list library defines the <code>head</code>
function as follows:
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-15' mode="ace/mode/lean" readonly="true">universe u
variable {α : Type u}

def head [inhabited α] : list α → α
| []       := default α
| (a :: l) := a
</juicy-ace-editor><div id='lean-full-code-15' style='display:none'>universe u
variable {α : Type u}

def head [inhabited α] : list α → α
| []       := default α
| (a :: l) := a
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-15').text());">Try it yourself &raquo;</button></div>
</div>

<p>
Another possibility is to add a precondition to the function. We can
do this because in the CIC, an assertion can be treated as an argument
to a function. The following function explicitly requires evidence
that the argument <code>l</code> is not the empty list.
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-16' mode="ace/mode/lean" readonly="true">def first : Π (l : list α), l ≠ [] → α
| []        h := absurd rfl h
| (a :: l₀) h := a</juicy-ace-editor><div id='lean-full-code-16' style='display:none'>universe u
variable {α : Type u}

def first : Π (l : list α), l ≠ [] → α
| []        h := absurd rfl h
| (a :: l₀) h := a
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-16').text());">Try it yourself &raquo;</button></div>
</div>
<p>
This contract ensures that <code>first</code> will never be called to evaluate
the first element of an empty list. The check is entirely static; the
evidence is ignored by the bytecode evaluator.
</p>

<p>
A closely related solution is to use a <code>subtype</code>. This simply bundles
together the data and the precondition. 
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-17' mode="ace/mode/lean" readonly="true">def first' : {l₀ // l₀ ≠ []} → α :=
λ l, first l.1 l.2</juicy-ace-editor><div id='lean-full-code-17' style='display:none'>universe u
variable {α : Type u}

def first : Π (l : list α), l ≠ [] → α
| []        h := absurd rfl h
| (a :: l₀) h := a

def first' : {l₀ // l₀ ≠ []} → α :=
λ l, first l.1 l.2
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-17').text());">Try it yourself &raquo;</button></div>
</div>
<p>
Here, the type <code>{l₀ // l₀ ≠ []}</code> consists of (dependent) pairs, where the first
element is a list and the second is evidence that the list is
nonempty. In a similar way, <code>{n // (n : ℤ) &gt; 0}</code> denotes the type of
positive integers. Using subtypes and preconditions can be inconvenient at
times, because using them requires a mixture of proof and
calculation. But subtypes are especially useful when the constraints
are common enough that is pays to develop a library of functions that
take and return elements satisfying them &#x2014; in other words, when the
subtype is really worthy of being considered a type in its own right.
</p>

<p>
Yet another solution is to signal the success or failure of the function
on the output, using an <code>option</code> type. This is defined in the standard
library as follows:
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-18' mode="ace/mode/lean" readonly="true">inductive option (α : Type u)
| none {} : option
| some    : α → option</juicy-ace-editor><div id='lean-full-code-18' style='display:none'>namespace hide

universe u

inductive option (α : Type u)
| none {} : option
| some    : α → option

end hide
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-18').text());">Try it yourself &raquo;</button></div>
</div>
<p>
You can think of the return value <code>none</code> as signifying that the
function is undefined at that point, whereas <code>some a</code> denotes a return
value of <code>a</code>. (The inscription <code>{}</code> after the none constructor
indicates that the argument <code>α</code> should be marked implicit, even though
it cannot be inferred from other arguments.) For example, then <code>nth</code>
element function is defined in the list library as follows:
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-19' mode="ace/mode/lean" readonly="true">def nth : list α → nat → option α
| []       n     := none
| (a :: l) 0     := some a
| (a :: l) (n+1) := nth l n</juicy-ace-editor><div id='lean-full-code-19' style='display:none'>universe u
variables {α : Type u} [inhabited α]

open option nat

def nth : list α → nat → option α
| []       n     := none
| (a :: l) 0     := some a
| (a :: l) (n+1) := nth l n
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-19').text());">Try it yourself &raquo;</button></div>
</div>
<p>
To use an element <code>oa</code> of type <code>option α</code>, one typically has to
pattern match on the cases <code>none</code> and <code>some α</code>. Doing this manually in the
course of a computation can be tedious, but it is much more pleasant
and natural using <i>monads</i>, which we turn to next.
</p>
</div>
</div>
