03_Programming_in_Lean.org
** Monads

This section assumes that you are familiar with the use of monads in
functional programming languages, such as Haskell. There are a number
of tutorials on monads available online, including a chapter of
[[https://leanprover.github.io/programming_in_lean/][Programming in Lean]].

Monads are well supported in Lean: they are straightforward to encode
in dependent type theory, and class inference can be used to infer
monads associated with specific types. Lean knows about the option
monad:
#+BEGIN_SRC lean
open list

def foo (l₁ l₂ l₃ : list ℕ) : option (list ℕ) :=
do v₁₀ ← nth l₁ 0,
   v₂₀ ← nth l₂ 0,
   v₂₁ ← nth l₂ 1,
   v₃₀ ← nth l₃ 0,
   v₃₁ ← nth l₃ 1,
   v₃₂ ← nth l₃ 2,
   return [v₁₀, v₂₀, v₂₁, v₃₀, v₃₁, v₃₂]

#eval foo [1, 2, 3] [4, 5] [6, 7]
#eval foo [1, 2, 3] [4, 5] [6, 7, 8]
#+END_SRC
Here, if an calls to =nth= return =none=, =foo= returns =none= as
well. But if all the calls are successful, the function constructs the
value on the last line and returns it wrapped with the =some=
constructor.

Lean also knows about the list monad:
#+BEGIN_SRC lean
open list

def foo : list string :=
do n ← range 10,
   a ← ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j"],
   repeat a n

#eval foo
#+END_SRC
Think of the body of =foo= is choosing a value =n=
nondeterministically from =range 10=, and a value =a=
nondeterministically from the given list, and returning the value
=repeat a n=, which simply repeats the element =a= =n= times. In fact,
=repeat a n= is computed for each choices of =n= and =a=, and the
results are concatenated into a single list.

The standard library also defines a state monad, and a special
=tactic= monad provides metaprogramming access to an internal tactic
state, allowing users to write tactics in Lean. We will return to this
in a later chapter.

# TODO(Jeremy): add reference when the chapter exists.

** Input and Output

Lean can access standard input and output via a special =io=
monad. From within the foundational system, the functions =put_str=
and =get_str= are simply unaxiomatized constants, but when executed by
the virtual machine, the perform the desired operations.

The input faculty can only be used when running Lean from a command
line, but standard output is associated to function calls in the
editor. The following example uses the =io= monad to output a list of
instructions solving the /Tower of Hanoi/ game for any number of
disks.

#+BEGIN_SRC lean
import system.io
variable [io.interface]
open io

def hanoi_aux : ℕ → string → string → string → io unit
| 0     fr to aux := put_str "nothing to do!\n"
| 1     fr to aux := put_str ("move disk 1 from " ++ fr ++ " to " ++ 
                               to ++ "\n")
| (n+2) fr to aux := do hanoi_aux (n+1) fr aux to,
                        put_str ("move disk " ++ to_string (n+2) ++ 
                                 " from " ++ fr ++ " to " ++ to ++ "\n"),
                        hanoi_aux (n+1) aux to fr

def hanoi (n : ℕ) := hanoi_aux n "A" "B" "C"

#eval hanoi 5
#+END_SRC

