03_Programming_in_Lean.html

<div id="outline-container-org62ba731" class="outline-3">
<h3 id="org62ba731"><span class="section-number-3"> 3.4</span> Monads</h3>
<div class="outline-text-3" id="text-1-4">
<p>
This section assumes that you are familiar with the use of monads in
functional programming languages, such as Haskell. There are a number
of tutorials on monads available online, including a chapter of
<a target='_blank' href="https://leanprover.github.io/programming_in_lean/">Programming in Lean</a>.
</p>

<p>
Monads are well supported in Lean: they are straightforward to encode
in dependent type theory, and class inference can be used to infer
monads associated with specific types. Lean knows about the option
monad:
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-20' mode="ace/mode/lean" readonly="true">open list

def foo (l₁ l₂ l₃ : list ℕ) : option (list ℕ) :=
do v₁₀ ← nth l₁ 0,
   v₂₀ ← nth l₂ 0,
   v₂₁ ← nth l₂ 1,
   v₃₀ ← nth l₃ 0,
   v₃₁ ← nth l₃ 1,
   v₃₂ ← nth l₃ 2,
   return [v₁₀, v₂₀, v₂₁, v₃₀, v₃₁, v₃₂]

#eval foo [1, 2, 3] [4, 5] [6, 7]
#eval foo [1, 2, 3] [4, 5] [6, 7, 8]
</juicy-ace-editor><div id='lean-full-code-20' style='display:none'>open list

def foo (l₁ l₂ l₃ : list ℕ) : option (list ℕ) :=
do v₁₀ ← nth l₁ 0,
   v₂₀ ← nth l₂ 0,
   v₂₁ ← nth l₂ 1,
   v₃₀ ← nth l₃ 0,
   v₃₁ ← nth l₃ 1,
   v₃₂ ← nth l₃ 2,
   return [v₁₀, v₂₀, v₂₁, v₃₀, v₃₁, v₃₂]

#eval foo [1, 2, 3] [4, 5] [6, 7]
#eval foo [1, 2, 3] [4, 5] [6, 7, 8]
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-20').text());">Try it yourself &raquo;</button></div>
</div>
<p>
Here, if an calls to <code>nth</code> return <code>none</code>, <code>foo</code> returns <code>none</code> as
well. But if all the calls are successful, the function constructs the
value on the last line and returns it wrapped with the <code>some</code>
constructor.
</p>

<p>
Lean also knows about the list monad:
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-21' mode="ace/mode/lean" readonly="true">open list

def foo : list string :=
do n ← range 10,
   a ← ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j"],
   repeat a n

#eval foo
</juicy-ace-editor><div id='lean-full-code-21' style='display:none'>open list

def foo : list string :=
do n ← range 10,
   a ← ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j"],
   repeat a n

#eval foo
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-21').text());">Try it yourself &raquo;</button></div>
</div>
<p>
Think of the body of <code>foo</code> is choosing a value <code>n</code>
nondeterministically from <code>range 10</code>, and a value <code>a</code>
nondeterministically from the given list, and returning the value
<code>repeat a n</code>, which simply repeats the element <code>a</code> <code>n</code> times. In fact,
<code>repeat a n</code> is computed for each choices of <code>n</code> and <code>a</code>, and the
results are concatenated into a single list.
</p>

<p>
The standard library also defines a state monad, and a special
<code>tactic</code> monad provides metaprogramming access to an internal tactic
state, allowing users to write tactics in Lean. We will return to this
in a later chapter.
</p>
</div>
</div>

<div id="outline-container-org980b472" class="outline-3">
<h3 id="org980b472"><span class="section-number-3"> 3.5</span> Input and Output</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Lean can access standard input and output via a special <code>io</code>
monad. From within the foundational system, the functions <code>put_str</code>
and <code>get_str</code> are simply unaxiomatized constants, but when executed by
the virtual machine, the perform the desired operations.
</p>

<p>
The input faculty can only be used when running Lean from a command
line, but standard output is associated to function calls in the
editor. The following example uses the <code>io</code> monad to output a list of
instructions solving the <i>Tower of Hanoi</i> game for any number of
disks.
</p>

<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-22' mode="ace/mode/lean" readonly="true">import system.io
variable [io.interface]
open io

def hanoi_aux : ℕ → string → string → string → io unit
| 0     fr to aux := put_str "nothing to do!\n"
| 1     fr to aux := put_str ("move disk 1 from " ++ fr ++ " to " ++ 
                               to ++ "\n")
| (n+2) fr to aux := do hanoi_aux (n+1) fr aux to,
                        put_str ("move disk " ++ to_string (n+2) ++ 
                                 " from " ++ fr ++ " to " ++ to ++ "\n"),
                        hanoi_aux (n+1) aux to fr

def hanoi (n : ℕ) := hanoi_aux n "A" "B" "C"

#eval hanoi 5
</juicy-ace-editor><div id='lean-full-code-22' style='display:none'>import system.io
variable [io.interface]
open io

def hanoi_aux : ℕ → string → string → string → io unit
| 0     fr to aux := put_str "nothing to do!\n"
| 1     fr to aux := put_str ("move disk 1 from " ++ fr ++ " to " ++ 
                               to ++ "\n")
| (n+2) fr to aux := do hanoi_aux (n+1) fr aux to,
                        put_str ("move disk " ++ to_string (n+2) ++ 
                                 " from " ++ fr ++ " to " ++ to ++ "\n"),
                        hanoi_aux (n+1) aux to fr

def hanoi (n : ℕ) := hanoi_aux n "A" "B" "C"

#eval hanoi 5
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-22').text());">Try it yourself &raquo;</button></div>
</div>
</div>
</div>
