03_Programming_in_Lean.org
** An Example: Abstract Syntax

We close this chapter with an example that nicely illustrates the
capacities for algebraic abstraction in Lean and the CIC. We first
define an abstract type of arithmetic expressions, each of which is
either a variable, a numeral, a sum, or a product.
#+BEGIN_SRC lean
inductive arith_expr
| var   : ℕ → arith_expr
| const : ℕ → arith_expr
| plus  : arith_expr → arith_expr → arith_expr
| times : arith_expr → arith_expr → arith_expr

open arith_expr

def sample_expr := plus (times (const 7) (var 0)) (times (const 2) (var 1))
#+END_SRC
Notice that the variables are indexed by the natural numbers.

We can evaluate an arithmetic expression in any semiring, given an
assignment to the variables. We can define a variable assignment to be
simply a function from the natural numbers to elements of the carrier
type, but it is more convenient to specify an assignment by giving a
finite list of values for the initial variables and using a default
value elsewhere.
#+BEGIN_SRC lean
universe u

def var_assignment (α : Type u) := ℕ → α

def var_assignment_of_list {α : Type u} [inhabited α] (l : list α) : var_assignment α :=
λ n, match (list.nth l n) with
| some a := a
| none   := arbitrary α
end

section
variables (α : Type u) [inhabited α]
instance : has_coe (list α) (var_assignment α) := ⟨var_assignment_of_list⟩
end
#+END_SRC
The instance declaration at the end declares a 
=var_assignment_to_list= to be coercion. We need to know that =α= is
inhabited to be able to return a default value for variables whose
indices are largere than the length of the list.

We can interpret a numeral in any semiring. The following definition
uses well-founded recursion to carry out the cast; we use the =div=
and =mod= functions to carry the translation efficiently. The two
=have= statements give facts that are needed to justify the
well-founded recursion.
#+BEGIN_SRC lean
universe u

namespace semiring
variables {α : Type u} [semiring α]

def of_nat : ℕ → α 
| 0 := 0
| 1 := 1
| (n+2) := 
  have n / 2 < n + 2, 
    begin abstract { apply lt_of_le_of_lt, apply nat.div_le_self,
                     apply nat.lt_add_of_pos_right, apply nat.succ_pos } end,
  have n % 2 < n + 2, 
    begin abstract { apply nat.lt_add_left, apply nat.mod_lt,
                     apply nat.succ_pos } end,
  2 * of_nat (n / 2) + of_nat (n % 2) 

end semiring
#+END_SRC

We these in hand, the evaluation function for arithmetic expressions
can now be defined using a straightforward recursion on syntax:
#+BEGIN_SRC lean
universe u

inductive arith_expr
| var   : ℕ → arith_expr
| const : ℕ → arith_expr
| plus  : arith_expr → arith_expr → arith_expr
| times : arith_expr → arith_expr → arith_expr

open arith_expr

def sample_expr := plus (times (const 7) (var 0)) (times (const 2) (var 1))

namespace arith_expr

def var_assignment (α : Type u) := ℕ → α

def var_assignment_of_list {α : Type u} [inhabited α] (l : list α) : var_assignment α :=
λ n, match (list.nth l n) with
| some a := a
| none   := arbitrary α
end

section
instance {α : Type u} [add_monoid α] : inhabited α := ⟨0⟩ 

variables (α : Type u) [inhabited α]
instance : has_coe (list α) (var_assignment α) := ⟨var_assignment_of_list⟩
end

namespace semiring
variables {α : Type u} [semiring α]

def of_nat : ℕ → α 
| 0 := 0
| 1 := 1
| (n+2) := 
  have n / 2 < n + 2, 
    begin abstract { apply lt_of_le_of_lt, apply nat.div_le_self,
                     apply nat.lt_add_of_pos_right, apply nat.succ_pos } end,
  have n % 2 < n + 2, 
    begin abstract { apply nat.lt_add_left, apply nat.mod_lt,
                     apply nat.succ_pos } end,
  2 * of_nat (n / 2) + of_nat (n % 2) 

end semiring

-- BEGIN
variables (α : Type u) [semiring α]

def arith_eval (v : var_assignment α) : arith_expr → α
| (var n)       := v n
| (const n)     := semiring.of_nat n
| (plus e₁ e₂)  := arith_eval e₁ + arith_eval e₂
| (times e₁ e₂) := arith_eval e₁ * arith_eval e₂
-- END

end arith_expr
#+END_SRC

We can now try it out:
#+BEGIN_SRC lean
universe u

inductive arith_expr
| var : ℕ → arith_expr
| const : ℕ → arith_expr
| plus : arith_expr → arith_expr → arith_expr
| times : arith_expr → arith_expr → arith_expr

open arith_expr

def sample_expr := plus (times (const 7) (var 0)) (times (const 2) (var 1))

namespace arith_expr

def var_assignment (α : Type u) := ℕ → α

def var_assignment_of_list {α : Type u} [inhabited α] (l : list α) : var_assignment α :=
λ n, match (list.nth l n) with
| some a := a
| none   := arbitrary α
end

section
instance {α : Type u} [add_monoid α] : inhabited α := ⟨0⟩ 

variables (α : Type u) [inhabited α]
instance : has_coe (list α) (var_assignment α) := ⟨var_assignment_of_list⟩
end

namespace semiring
variables {α : Type u} [semiring α]

def of_nat : ℕ → α 
| 0 := 0
| 1 := 1
| (n+2) := 
  have n / 2 < n + 2, 
    begin abstract { apply lt_of_le_of_lt, apply nat.div_le_self,
                     apply nat.lt_add_of_pos_right, apply nat.succ_pos } end,
  have n % 2 < n + 2, 
    begin abstract { apply nat.lt_add_left, apply nat.mod_lt,
                     apply nat.succ_pos } end,
  2 * of_nat (n / 2) + of_nat (n % 2) 

end semiring

variables (α : Type u) [semiring α]

def arith_eval (v : var_assignment α) : arith_expr → α
| (var n)       := v n
| (const n)     := semiring.of_nat n
| (plus e₁ e₂)  := arith_eval e₁ + arith_eval e₂
| (times e₁ e₂) := arith_eval e₁ * arith_eval e₂


-- BEGIN
#eval arith_eval ℕ ↑[5, 7]        sample_expr
#eval arith_eval ℕ ↑[5, 7, 12]    sample_expr
#eval arith_eval ℕ ↑[5]           sample_expr

#check arith_eval ℤ ↑[(5 : ℤ), 7] sample_expr
-- END

end arith_expr
#+END_SRC
In these examples, we help out the elaborator by indicating
that we intend to coerce the list to a
=var_assignment=.
