03_Programming_in_Lean.html

<div id="outline-container-org11fcbee" class="outline-3">
<h3 id="org11fcbee"><span class="section-number-3"> 3.6</span> An Example: Abstract Syntax</h3>
<div class="outline-text-3" id="text-1-6">
<p>
We close this chapter with an example that nicely illustrates the
capacities for algebraic abstraction in Lean and the CIC. We first
define an abstract type of arithmetic expressions, each of which is
either a variable, a numeral, a sum, or a product.
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-23' mode="ace/mode/lean" readonly="true">inductive arith_expr
| var   : ℕ → arith_expr
| const : ℕ → arith_expr
| plus  : arith_expr → arith_expr → arith_expr
| times : arith_expr → arith_expr → arith_expr

open arith_expr

def sample_expr := plus (times (const 7) (var 0)) (times (const 2) (var 1))
</juicy-ace-editor><div id='lean-full-code-23' style='display:none'>inductive arith_expr
| var   : ℕ → arith_expr
| const : ℕ → arith_expr
| plus  : arith_expr → arith_expr → arith_expr
| times : arith_expr → arith_expr → arith_expr

open arith_expr

def sample_expr := plus (times (const 7) (var 0)) (times (const 2) (var 1))
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-23').text());">Try it yourself &raquo;</button></div>
</div>
<p>
Notice that the variables are indexed by the natural numbers.
</p>

<p>
We can evaluate an arithmetic expression in any semiring, given an
assignment to the variables. We can define a variable assignment to be
simply a function from the natural numbers to elements of the carrier
type, but it is more convenient to specify an assignment by giving a
finite list of values for the initial variables and using a default
value elsewhere.
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-24' mode="ace/mode/lean" readonly="true">universe u

def var_assignment (α : Type u) := ℕ → α

def var_assignment_of_list {α : Type u} [inhabited α] (l : list α) : var_assignment α :=
λ n, match (list.nth l n) with
| some a := a
| none   := arbitrary α
end

section
variables (α : Type u) [inhabited α]
instance : has_coe (list α) (var_assignment α) := ⟨var_assignment_of_list⟩
end
</juicy-ace-editor><div id='lean-full-code-24' style='display:none'>universe u

def var_assignment (α : Type u) := ℕ → α

def var_assignment_of_list {α : Type u} [inhabited α] (l : list α) : var_assignment α :=
λ n, match (list.nth l n) with
| some a := a
| none   := arbitrary α
end

section
variables (α : Type u) [inhabited α]
instance : has_coe (list α) (var_assignment α) := ⟨var_assignment_of_list⟩
end
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-24').text());">Try it yourself &raquo;</button></div>
</div>
<p>
The instance declaration at the end declares a 
<code>var_assignment_to_list</code> to be coercion. We need to know that <code>α</code> is
inhabited to be able to return a default value for variables whose
indices are largere than the length of the list.
</p>

<p>
We can interpret a numeral in any semiring. The following definition
uses well-founded recursion to carry out the cast; we use the <code>div</code>
and <code>mod</code> functions to carry the translation efficiently. The two
<code>have</code> statements give facts that are needed to justify the
well-founded recursion.
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-25' mode="ace/mode/lean" readonly="true">universe u

namespace semiring
variables {α : Type u} [semiring α]

def of_nat : ℕ → α 
| 0 := 0
| 1 := 1
| (n+2) := 
  have n / 2 &lt; n + 2, 
    begin abstract { apply lt_of_le_of_lt, apply nat.div_le_self,
                     apply nat.lt_add_of_pos_right, apply nat.succ_pos } end,
  have n % 2 &lt; n + 2, 
    begin abstract { apply nat.lt_add_left, apply nat.mod_lt,
                     apply nat.succ_pos } end,
  2 * of_nat (n / 2) + of_nat (n % 2) 

end semiring
</juicy-ace-editor><div id='lean-full-code-25' style='display:none'>universe u

namespace semiring
variables {α : Type u} [semiring α]

def of_nat : ℕ → α 
| 0 := 0
| 1 := 1
| (n+2) := 
  have n / 2 &lt; n + 2, 
    begin abstract { apply lt_of_le_of_lt, apply nat.div_le_self,
                     apply nat.lt_add_of_pos_right, apply nat.succ_pos } end,
  have n % 2 &lt; n + 2, 
    begin abstract { apply nat.lt_add_left, apply nat.mod_lt,
                     apply nat.succ_pos } end,
  2 * of_nat (n / 2) + of_nat (n % 2) 

end semiring
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-25').text());">Try it yourself &raquo;</button></div>
</div>

<p>
We these in hand, the evaluation function for arithmetic expressions
can now be defined using a straightforward recursion on syntax:
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-26' mode="ace/mode/lean" readonly="true">variables (α : Type u) [semiring α]

def arith_eval (v : var_assignment α) : arith_expr → α
| (var n)       := v n
| (const n)     := semiring.of_nat n
| (plus e₁ e₂)  := arith_eval e₁ + arith_eval e₂
| (times e₁ e₂) := arith_eval e₁ * arith_eval e₂</juicy-ace-editor><div id='lean-full-code-26' style='display:none'>universe u

inductive arith_expr
| var   : ℕ → arith_expr
| const : ℕ → arith_expr
| plus  : arith_expr → arith_expr → arith_expr
| times : arith_expr → arith_expr → arith_expr

open arith_expr

def sample_expr := plus (times (const 7) (var 0)) (times (const 2) (var 1))

namespace arith_expr

def var_assignment (α : Type u) := ℕ → α

def var_assignment_of_list {α : Type u} [inhabited α] (l : list α) : var_assignment α :=
λ n, match (list.nth l n) with
| some a := a
| none   := arbitrary α
end

section
instance {α : Type u} [add_monoid α] : inhabited α := ⟨0⟩ 

variables (α : Type u) [inhabited α]
instance : has_coe (list α) (var_assignment α) := ⟨var_assignment_of_list⟩
end

namespace semiring
variables {α : Type u} [semiring α]

def of_nat : ℕ → α 
| 0 := 0
| 1 := 1
| (n+2) := 
  have n / 2 &lt; n + 2, 
    begin abstract { apply lt_of_le_of_lt, apply nat.div_le_self,
                     apply nat.lt_add_of_pos_right, apply nat.succ_pos } end,
  have n % 2 &lt; n + 2, 
    begin abstract { apply nat.lt_add_left, apply nat.mod_lt,
                     apply nat.succ_pos } end,
  2 * of_nat (n / 2) + of_nat (n % 2) 

end semiring

variables (α : Type u) [semiring α]

def arith_eval (v : var_assignment α) : arith_expr → α
| (var n)       := v n
| (const n)     := semiring.of_nat n
| (plus e₁ e₂)  := arith_eval e₁ + arith_eval e₂
| (times e₁ e₂) := arith_eval e₁ * arith_eval e₂

end arith_expr
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-26').text());">Try it yourself &raquo;</button></div>
</div>

<p>
We can now try it out:
</p>
<div class="org-src-container">
<juicy-ace-editor id='lean-juicy-ace-editor-27' mode="ace/mode/lean" readonly="true">#eval arith_eval ℕ ↑[5, 7]        sample_expr
#eval arith_eval ℕ ↑[5, 7, 12]    sample_expr
#eval arith_eval ℕ ↑[5]           sample_expr

#check arith_eval ℤ ↑[(5 : ℤ), 7] sample_expr</juicy-ace-editor><div id='lean-full-code-27' style='display:none'>universe u

inductive arith_expr
| var : ℕ → arith_expr
| const : ℕ → arith_expr
| plus : arith_expr → arith_expr → arith_expr
| times : arith_expr → arith_expr → arith_expr

open arith_expr

def sample_expr := plus (times (const 7) (var 0)) (times (const 2) (var 1))

namespace arith_expr

def var_assignment (α : Type u) := ℕ → α

def var_assignment_of_list {α : Type u} [inhabited α] (l : list α) : var_assignment α :=
λ n, match (list.nth l n) with
| some a := a
| none   := arbitrary α
end

section
instance {α : Type u} [add_monoid α] : inhabited α := ⟨0⟩ 

variables (α : Type u) [inhabited α]
instance : has_coe (list α) (var_assignment α) := ⟨var_assignment_of_list⟩
end

namespace semiring
variables {α : Type u} [semiring α]

def of_nat : ℕ → α 
| 0 := 0
| 1 := 1
| (n+2) := 
  have n / 2 &lt; n + 2, 
    begin abstract { apply lt_of_le_of_lt, apply nat.div_le_self,
                     apply nat.lt_add_of_pos_right, apply nat.succ_pos } end,
  have n % 2 &lt; n + 2, 
    begin abstract { apply nat.lt_add_left, apply nat.mod_lt,
                     apply nat.succ_pos } end,
  2 * of_nat (n / 2) + of_nat (n % 2) 

end semiring

variables (α : Type u) [semiring α]

def arith_eval (v : var_assignment α) : arith_expr → α
| (var n)       := v n
| (const n)     := semiring.of_nat n
| (plus e₁ e₂)  := arith_eval e₁ + arith_eval e₂
| (times e₁ e₂) := arith_eval e₁ * arith_eval e₂


#eval arith_eval ℕ ↑[5, 7]        sample_expr
#eval arith_eval ℕ ↑[5, 7, 12]    sample_expr
#eval arith_eval ℕ ↑[5]           sample_expr

#check arith_eval ℤ ↑[(5 : ℤ), 7] sample_expr

end arith_expr
</div><div class='no-print' align="left"><button type="button" onclick="invoke_leanjs($('#lean-full-code-27').text());">Try it yourself &raquo;</button></div>
</div>
<p>
In these examples, we help out the elaborator by indicating
that we intend to coerce the list to a
<code>var_assignment</code>.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
